Books_And_Tutorials/cpp/SmartPointers/SmartPointers.org
#+BEGIN_HTML
<meta http-equiv="Content-Style-Type" content="text/css">
<link rel="stylesheet" href="../../../CSS/org-style.css" type="text/css" />
<div id="postamble">
<p class="author"> 
   Author: Pralay Patoria
   <a href="mailto:ppatoria@gmail.com">&lt;ppatoria@gmail.com&gt;</a>
</p>
<p class="date"> Date: 24-12-2013</p>
</div>
#+END_HTML
#+OPTIONS: date:nil, creator:nil, author:nil				
#+TITLE: Smart Pointers

[TABLE-OF-CONTENTS]

* ~auto_ptr~:
**    Issues: 
        * implicit transfer of ownership. Which makes this confusing and dangerous if not handles properly.         

* ~scoped_ptr~:
        * explicit transfer if ownership.

* ~unique_ptr~:

* ~shared_ptr~:
        * Multiple pointer can share the same object.
        * automatic reference counting.
**      Issue:
        * *cyclic reference:* in case of cyclic refrence both the shared pointers which are refering each other will not be deallocated. 
* ~intrusive_ptr~:
        * Shared pointer where custom reference counting is maintained by the user.
* ~weak_ptr~:
        * acquire shared pointer when required else just do not refer it. 


*Reference:* \\ 
[[./smartpointers.xps][Smart Pointers]] \\
[[./C++_scoped_ptr_and_unique_ptr_smart_pointers.htm][scoped pointer and unique pointer]] \\          
[[../boost/boost_functionalities.html][SmartPointers provided by boost]]

*Code Samples:* \\
[[../../../Code/CPP/SmartPointers][Smart Pointers]]
