Books_And_Tutorials/cpp/SmartPointers/SmartPointers.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Smart Pointers</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-26 11:17:26 "/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Smart Pointers</h1>


<meta http-equiv="Content-Style-Type" content="text/css">
<link rel="stylesheet" href="../../../CSS/org-style.css" type="text/css" />
<div id="postamble">
<p class="author"> 
   Author: Pralay Patoria
   <a href="mailto:ppatoria@gmail.com">&lt;ppatoria@gmail.com&gt;</a>
</p>
<p class="date"> Date: 24-12-2013</p>
</div>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 <code>auto_ptr</code>: </a>
<ul>
<li><a href="#sec-1_1">1.1 Issues: </a></li>
</ul>
</li>
<li><a href="#sec-2">2 <code>scoped_ptr</code>: </a></li>
<li><a href="#sec-3">3 <code>unique_ptr</code>: </a></li>
<li><a href="#sec-4">4 <code>shared_ptr</code>: </a>
<ul>
<li><a href="#sec-4_1">4.1 Issue: </a></li>
</ul>
</li>
<li><a href="#sec-5">5 <code>intrusive_ptr</code>: </a></li>
<li><a href="#sec-6">6 <code>weak_ptr</code>: </a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <code>auto_ptr</code>: </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> Issues: </h3>
<div class="outline-text-3" id="text-1_1">

<ul>
<li>
implicit transfer of ownership. Which makes this confusing and dangerous if not handles properly.         

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <code>scoped_ptr</code>: </h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>
explicit transfer if ownership.

</li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <code>unique_ptr</code>: </h2>
<div class="outline-text-2" id="text-3">


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <code>shared_ptr</code>: </h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>
Multiple pointer can share the same object.
</li>
<li>
automatic reference counting.
</li>
</ul>

</div>

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1"><span class="section-number-3">4.1</span> Issue: </h3>
<div class="outline-text-3" id="text-4_1">

<ul>
<li>
<b>cyclic reference:</b> in case of cyclic refrence both the shared pointers which are refering each other will not be deallocated. 
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <code>intrusive_ptr</code>: </h2>
<div class="outline-text-2" id="text-5">

<ul>
<li>
Shared pointer where custom reference counting is maintained by the user.
</li>
</ul>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <code>weak_ptr</code>: </h2>
<div class="outline-text-2" id="text-6">

<ul>
<li>
acquire shared pointer when required else just do not refer it. 


</li>
</ul>

<p><b>Reference:</b> <br/>
<a href="./smartpointers.xps">Smart Pointers</a> <br/>
<a href="./C++_scoped_ptr_and_unique_ptr_smart_pointers.htm">scoped pointer and unique pointer</a> <br/>
<a href="../boost/boost_functionalities.html">SmartPointers provided by boost</a>
</p>
<p>
<b>Code Samples:</b> <br/>
<a href="../../../Code/CPP/SmartPointers">Smart Pointers</a>
</p></div>
</div>
<div id="postamble">
<p class="date"> Date: 2013-12-26 11:17:26 </p>
</div>
</div>
</body>
</html>
